{
  "date": "2025-11-23",
  "songs": [
    {
      "title": "Farewell(I Miss You)",
      "artist": "Rustycore",
      "artistUrl": "https://open.spotify.com/artist/4GGmVST3SUdrZy3tM5Ywyv?si=GSeRNVT9SumnuRiT4JjS3w",
      "youtubeUrl": "https://open.spotify.com/track/1ucmQcJr0OODk3DbwCnSXE?si=f393266f5faa43f4",
      "lyrics": [
        "Pure Music"
      ],
      "date": "2025-11-23"
    },
    {
      "title": "20th Century Boy",
      "artist": "T.Rex",
      "artistUrl": "https://open.spotify.com/artist/3dBVyJ7JuOMt4GE9607Qin?si=rVjB7JcJSwyncQxwu_ZfpA",
      "youtubeUrl": "https://open.spotify.com/track/1y5LL9dpLXbCXNKKqw5wCJ?si=d59a699a23074a1b",
      "lyrics": [
        "A Japanese comic with the same name is very interesting. (https://en.wikipedia.org/wiki/20th_Century_Boys)"
      ],
      "date": "2025-11-23"
    },
    {
      "title": "Human Nature",
      "artist": "Micheal Jackson",
      "artistUrl": "https://en.wikipedia.org/wiki/Human_Nature_(Michael_Jackson_song)",
      "youtubeUrl": "https://open.spotify.com/track/4cgjA7B4fJBHyB9Ya2bu0t?si=bee810d91469482b",
      "lyrics": [
        "A beautiful from Micheal Jackson"
      ],
      "date": "2025-11-23"
    },
    {
      "title": "25 or 6 to 4",
      "artist": "Chicago",
      "artistUrl": "https://open.spotify.com/artist/3iDD7bnsjL9J4fO298r0L0?si=2NUgQXAiSDK6W0SwOpQx0g",
      "youtubeUrl": "https://open.spotify.com/track/65eRcjlStTnk8opG5eIQ8Z?si=29165d5b74ec4886",
      "lyrics": [
        "“25 or 6 to 4” — Lyrics Meaning Explained (Line by Line)",
        "Verse 1: Struggling for Inspiration",
        "“Waiting for the break of day / Searching for something to say”",
        "The song opens in the middle of the night. The narrator is exhausted and struggling to find the right words—likely for a song. It sets the tone of creative frustration and late-night writer’s block.",
        "“Flashing lights against the sky / Giving up, I close my eyes”",
        "The flashing lights may be streetlights, headlights, or even visual distortions caused by fatigue. This blurs the line between wakefulness and sleep.",
        "“Giving up” shows how overwhelmed he feels, while closing his eyes signals a momentary surrender to exhaustion or an attempt to look inward for inspiration.",
        "⸻",
        "Chorus: The Meaning Behind the Title",
        "“Sitting cross-legged on the floor / Twenty-five or six to four”",
        "Sitting cross-legged conveys a relaxed but drained posture, as if he’s been working for hours.",
        "The title phrase refers to the time—3:34 or 3:35 AM.",
        "The slightly vague wording (“25 or 6 to 4”) matches the hazy, dreamlike state of someone too tired to articulate the exact time.",
        "⸻",
        "Verse 2: Battling Exhaustion",
        "“Staring blindly into space / Getting up to splash my face”",
        "He’s zoning out, staring blankly into nothing. Splashing water on his face is a classic attempt to stay awake and stay focused.",
        "“Wanting just to stay awake / Wondering how much I can take”",
        "Fatigue is taking over.",
        "“How much I can take” suggests not only physical exhaustion but also emotional frustration and self-doubt.",
        "This is one reason some listeners interpreted the song as being about drugs, though the songwriter has denied this.",
        "⸻",
        "Chorus 2: A Moment of Decision",
        "“Should I try to do some more? / Twenty-five or six to four”",
        "He questions whether he should keep pushing or finally give in to sleep.",
        "The time repeats, reinforcing the endless feeling of the late-night creative struggle.",
        "⸻",
        "Verse 3: The Room Begins to Spin",
        "“Feeling like I ought to sleep / Spinning room is sinking deep”",
        "Sleep deprivation is catching up.",
        "The spinning room suggests dizziness or a drifting state of consciousness, adding to the song’s surreal, almost psychedelic atmosphere.",
        "“Searching for something to say / Waiting for the break of day”",
        "The song circles back to its beginning, emphasizing that the battle for inspiration continues. Morning still hasn’t arrived, and he’s stuck in the same loop.",
        "⸻",
        "Overall Meaning: A Creative Battle at 3:35 AM",
        "“25 or 6 to 4” describes the frustration of trying to write a song in the middle of the night—drained, foggy, and desperate for inspiration.",
        "Although the imagery has led to decades of speculation about drugs, songwriter Robert Lamm confirmed the meaning is simple:",
        "It’s about writing a song while exhausted, at around 3:35 in the morning.",
        "The cryptic title and vivid imagery have kept listeners intrigued for decades, making this one of Chicago’s most discussed songs."
      ],
      "date": "2025-11-23"
    },
    {
      "title": "Stairway to Heaven",
      "artist": "Led Zeppelin",
      "artistUrl": "https://open.spotify.com/artist/36QJpDe2go2KgaRleHCDTp?si=CYcasAG9QAukpqDGQoucCQ",
      "youtubeUrl": "https://open.spotify.com/track/5CQ30WqJwcep0pYcV4AMNc?si=773533b24c7f41ce",
      "lyrics": [
        "“Stairway to Heaven” was first performed publicly on March 5, 1971, at Ulster Hall in Belfast. Bassist John Paul Jones recalled that the audience was unimpressed, waiting for songs they already knew.",
        "The song’s world broadcast premiere took place on April 1, 1971, at the Paris Cinema with a live audience, and it aired on the BBC three days later. From that point on, Led Zeppelin performed the song at nearly every concert, except for rare cases when curfews or technical issues forced an early end. Their final live performance of the song (before the 2007 reunion) was on July 7, 1980, in Berlin—their last full concert.",
        "Jimmy Page famously used a double-neck Gibson EDS-1275 guitar to play the song live, allowing him to switch between six-string and twelve-string parts without interruption. John Paul Jones played a Mellotron to recreate the woodwind sounds from the studio recording.",
        "Live versions often stretched beyond ten minutes, with Page extending the guitar solo and Plant improvising lines such as “Does anyone remember laughter?”",
        "By 1975, the band typically used the song as their closing number. After the 1977 U.S. tour, Robert Plant began to dislike performing it, saying it became impossible to sing with genuine feeling.",
        "The surviving members played the song again at Live Aid in 1985, at Atlantic Records’ 40th anniversary in 1988 with Jason Bonham on drums, and Jimmy Page also performed instrumental versions on his solo tours. Page and Plant occasionally incorporated parts of “Stairway to Heaven” into other songs during their tours, and they performed an acoustic version on Japanese TV in 1994.",
        "Their most notable later performance was at the Ahmet Ertegun Tribute Concert at London’s O2 Arena on December 10, 2007.",
        "Plant described the Live Aid performance—with two drummers and members of Duran Duran crying at the side of the stage—as “surreal.”",
        "⸻",
        "«Stairway to Heaven» впервые была исполнена публично 5 марта 1971 года в зале Алстер-холл в Белфасте. Басист Джон Пол Джонс вспоминал, что публика осталась равнодушной и ждала более знакомых песен.",
        "Мировая радиопремьера состоялась 1 апреля 1971 года в Paris Cinema при живой аудитории, а через три дня запись вышла в эфир BBC. С того момента Led Zeppelin исполняли песню почти на каждом концерте, за редкими исключениями, когда выступление прекращалось из-за комендантского часа или технических проблем. Последний раз (до воссоединения в 2007 году) группа исполнила песню 7 июля 1980 года в Берлине — это был их последний полный концерт.",
        "Джимми Пейдж исполнял песню на сцене с помощью двухгрифовой гитары Gibson EDS-1275, что позволяло ему переключаться между шестиструнной и двенадцатиструнной партиями без пауз. Джон Пол Джонс использовал Mellotron, чтобы воспроизвести тембр духовых инструментов из студийной версии.",
        "Живые версии часто растягивались более чем на десять минут: Пейдж удлинял гитарное соло, а Плант импровизировал строки вроде «Кто-нибудь помнит смех?»",
        "К 1975 году песня стала обычно завершающим номером концертов. Однако после тура по США в 1977 году Роберт Плант признался, что ему надоело исполнять её: по его словам, песня перестала звучать искренне.",
        "Участники, оставшиеся в живых, вновь исполнили композицию на Live Aid в 1985 году, затем — на 40-летии Atlantic Records в 1988-м, где на барабанах играл Джейсон Бонэм. Пейдж также исполнял инструментальные версии на сольных турах. Во время совместных туров Пейдж и Плант иногда включали фрагменты «Stairway to Heaven» в другие песни и в 1994 году исполнили акустическую версию на японском телевидении.",
        "Знаковым поздним выступлением стало исполнение на концерте памяти Ахмета Эртегюна 10 декабря 2007 года в лондонском O2 Arena.",
        "Плант называл выступление на Live Aid самым необычным: «Тогда было два барабанщика, а участники Duran Duran стояли у сцены и плакали — это было сюрреалистично»."
      ],
      "date": "2025-11-23"
    }
  ]
}